src/Enums/СтатусыПроверкиМаркированнойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыПроверкиМаркированнойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПроверялась</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВНаличии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЧислилась</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыМаркируемойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыМаркируемойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алкогольная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табачная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обувная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыШтрихкодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыШтрихкодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>PDF417</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DataMatrix</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ITF14</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EAN8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EAN13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Code39</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Code128</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SSCC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GS1_DataBarExpandedStacked</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GS1_128</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GS1_DataMatrix</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыУпаковокМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУпаковокМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Логистическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Групповая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Потребительская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ШтрихкодированиеМПСервер/Ext/Module.bsl
#Область ВнешнееСобытие

Функция НайтиСтрокуМарки(Объект, GTIN, СерийныйНомер)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("GTIN",          GTIN);
	СтруктураОтбора.Вставить("СерийныйНомер", СерийныйНомер);
	
	НайденныеСтроки = Объект.Марки.НайтиСтроки(СтруктураОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		НайденнаяСтрока = Неопределено;
	Иначе
		НайденнаяСтрока = НайденныеСтроки[0];
	КонецЕсли;
	
	Возврат НайденнаяСтрока;
	
КонецФункции

Функция НайтиТоварнуюСтрокуПоИдентификатору(Объект, ИдентификаторСтроки)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		НайденнаяСтрока = Неопределено;
	Иначе
		НайденнаяСтрока = НайденныеСтроки[0];
	КонецЕсли;
	
	Возврат НайденнаяСтрока;
	
КонецФункции

Функция ПолучитьКоэффициентШтрихКода(ШтрихКод)
	
	Результат = 1;
	
	ОбъектыПоШтрихкоду = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(ШтрихКод,,Истина);
	Если ОбъектыПоШтрихкоду.Количество()>0 Тогда
		ЕдиницаИзмерения = ОбъектыПоШтрихкоду[0].ЕдиницаИзмерения;
		Если ЗначениеЗаполнено(ЕдиницаИзмерения) тогда
			Результат = ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
	КонецЕсли;
		
	Возврат Результат; 
	
КонецФункции

Функция ОбработкаМаркиПоступления(Форма, Объект, КодМарки, ПараметрыДействия) Экспорт
	
	Если ПараметрыДействия.Свойство("ДоступныеПоля") Тогда
		ПараметрыДействия.ДоступныеПоля.Вставить("ВыборТовара");
	Иначе
		ДоступныеПоля = Новый Структура;
		ДоступныеПоля.Вставить("ВыборТовара");
		ПараметрыДействия.Вставить("ДоступныеПоля", ДоступныеПоля);
	КонецЕсли;
	
	УникальныйИдентификаторФормы = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "УникальныйИдентификаторФормы", "");
	Если ПустаяСтрока(УникальныйИдентификаторФормы) Тогда
		УникальныйИдентификаторФормы = ?(Форма = Неопределено, Неопределено, Форма.УникальныйИдентификатор);
	КонецЕсли;
	
	НайденнаяСтрока    = Неопределено;
	ШтрихКод           = "";
	МРЦ                = 0;
	СерийныйНомер      = "";
	Результат          = Ложь;
	СтрокаНоменклатура = Неопределено;
	ЗначениеШтрихКода  = Неопределено;
	СтатусПроверки     = Неопределено;
	РезультатРазбора   = Неопределено;
	GTIN               = "";
	СерийныйНомер      = "";
	НормализованныйКодМарки = "";
	Если ШтрихкодированиеМПКлиентСервер.ЭтоКодМаркировкиТабачнойПачки(КодМарки, ШтрихКод, МРЦ, РезультатРазбора) Тогда
		
		//ЗначениеШтрихКода = ШтрихкодированиеМОТПКлиентСервер.КодМаркировкиДляПередачиМОТП(КодМарки, Истина);
		GTIN                    = РезультатРазбора.СоставКодаМаркировки.GTIN;
		СерийныйНомер           = РезультатРазбора.СоставКодаМаркировки.СерийныйНомер;
		НормализованныйКодМарки = РезультатРазбора.НормализованныйКодМаркировки;
		
		НайденнаяСтрока = НайтиСтрокуМарки(Объект, GTIN, СерийныйНомер);
		Если НайденнаяСтрока = Неопределено Тогда
			ПараметрыДействия.Вставить("ШтрихКод", ШтрихКод);
			ШтрихкодированиеВызовСервера.ВыполнитьПоискОбъектовПоШтрихкодуУДокумента(Форма, Объект, ПараметрыДействия);
			СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеЧислилась;
		Иначе
			Если НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеПроверялась ИЛИ 
				НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.Отсутствует Тогда
				НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.ВНаличии;
			КонецЕсли;
			
			ТоварнаяСтрока = НайтиТоварнуюСтрокуПоИдентификатору(Объект, НайденнаяСтрока.ИдентификаторСтроки);
			Если НЕ ТоварнаяСтрока = Неопределено Тогда
				ФактическоеКоличество = Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, СтатусПроверки", НайденнаяСтрока.ИдентификаторСтроки, Перечисления.СтатусыПроверкиМаркированнойПродукции.Отсутствует)).Количество();
				ФактическоеКоличество = ФактическоеКоличество + Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, СтатусПроверки", НайденнаяСтрока.ИдентификаторСтроки, Перечисления.СтатусыПроверкиМаркированнойПродукции.ВНаличии)).Количество();
				
				КоэффициентШтрихКода = ПолучитьКоэффициентШтрихКода(ШтрихКод);
				
				ФактическоеКоличество = ФактическоеКоличество*КоэффициентШтрихКода;
				Количество = ТоварнаяСтрока.Количество*ТоварнаяСтрока.Коэффициент;
				
				НовоеКоличество = Макс(Количество, ФактическоеКоличество);
				Если НЕ НовоеКоличество = Количество Тогда
					ТоварнаяСтрока.Количество = НовоеКоличество/ТоварнаяСтрока.Коэффициент;
					Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(Объект, ТоварнаяСтрока, ПараметрыДействия);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ШтрихкодированиеМОТПКлиентСервер.ЭтоКодМаркировкиБлока(КодМарки, ШтрихКод, МРЦ, СерийныйНомер, РезультатРазбора) Тогда
		
		GTIN                    = РезультатРазбора.СоставКодаМаркировки.GTIN;
		СерийныйНомер           = РезультатРазбора.СоставКодаМаркировки.СерийныйНомер;
		НормализованныйКодМарки = РезультатРазбора.НормализованныйКодМаркировки;
		
		НайденнаяСтрока = НайтиСтрокуМарки(Объект, GTIN, СерийныйНомер);
		Если НайденнаяСтрока = Неопределено Тогда
			ПараметрыДействия.Вставить("ШтрихКод", ШтрихКод);
			ШтрихкодированиеВызовСервера.ВыполнитьПоискОбъектовПоШтрихкодуУДокумента(Форма, Объект, ПараметрыДействия);
			СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеЧислилась;
		Иначе
			Если НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеПроверялась ИЛИ 
				НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.Отсутствует Тогда
				НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.ВНаличии;
			КонецЕсли;
			
			ТоварнаяСтрока = НайтиТоварнуюСтрокуПоИдентификатору(Объект, НайденнаяСтрока.ИдентификаторСтроки);
			Если НЕ ТоварнаяСтрока = Неопределено Тогда
				ФактическоеКоличество = Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, СтатусПроверки", НайденнаяСтрока.ИдентификаторСтроки, Перечисления.СтатусыПроверкиМаркированнойПродукции.Отсутствует)).Количество();
				ФактическоеКоличество = ФактическоеКоличество + Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, СтатусПроверки", НайденнаяСтрока.ИдентификаторСтроки, Перечисления.СтатусыПроверкиМаркированнойПродукции.ВНаличии)).Количество();
				
				КоэффициентШтрихКода = ПолучитьКоэффициентШтрихКода(ШтрихКод);
				
				ФактическоеКоличество = ФактическоеКоличество*КоэффициентШтрихКода;
				Количество = ТоварнаяСтрока.Количество*ТоварнаяСтрока.Коэффициент;
				
				НовоеКоличество = Макс(Количество, ФактическоеКоличество);
				Если НЕ НовоеКоличество = Количество Тогда
					ТоварнаяСтрока.Количество = НовоеКоличество/ТоварнаяСтрока.Коэффициент;
					Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(Объект, ТоварнаяСтрока, ПараметрыДействия);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ШтрихкодированиеМПКлиентСервер.ЭтоКодМаркировкиПотребительскойУпаковки(КодМарки, ШтрихКод, СерийныйНомер,,РезультатРазбора) Тогда
		
		GTIN                    = РезультатРазбора.СоставКодаМаркировки.GTIN;
		СерийныйНомер           = РезультатРазбора.СоставКодаМаркировки.СерийныйНомер;
		НормализованныйКодМарки = РезультатРазбора.НормализованныйКодМаркировки;
		
		ЗначениеШтрихКода = ШтрихкодированиеМПКлиентСервер.КодМаркировкиДляПередачиИСМП(КодМарки);
		
		НайденнаяСтрока = НайтиСтрокуМарки(Объект, GTIN, СерийныйНомер);
		Если НайденнаяСтрока = Неопределено Тогда
			ПараметрыДействия.Вставить("ШтрихКод", ШтрихКод);
			ШтрихкодированиеВызовСервера.ВыполнитьПоискОбъектовПоШтрихкодуУДокумента(Форма, Объект, ПараметрыДействия);
			СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеЧислилась;
		Иначе
			Если НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеПроверялась ИЛИ 
				НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.Отсутствует Тогда
				НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.ВНаличии;
			КонецЕсли;
			ТоварнаяСтрока = НайтиТоварнуюСтрокуПоИдентификатору(Объект, НайденнаяСтрока.ИдентификаторСтроки);
			Если НЕ ТоварнаяСтрока = Неопределено Тогда
				ФактическоеКоличество = Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, СтатусПроверки", НайденнаяСтрока.ИдентификаторСтроки, Перечисления.СтатусыПроверкиМаркированнойПродукции.Отсутствует)).Количество();
				ФактическоеКоличество = ФактическоеКоличество + Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, СтатусПроверки", НайденнаяСтрока.ИдентификаторСтроки, Перечисления.СтатусыПроверкиМаркированнойПродукции.ВНаличии)).Количество();
				
				КоэффициентШтрихКода = ПолучитьКоэффициентШтрихКода(ШтрихКод);
				
				ФактическоеКоличество = ФактическоеКоличество*КоэффициентШтрихКода;
				Количество = ТоварнаяСтрока.Количество*ТоварнаяСтрока.Коэффициент;
				
				НовоеКоличество = Макс(Количество, ФактическоеКоличество);
				Если НЕ НовоеКоличество = Количество Тогда
					ТоварнаяСтрока.Количество = НовоеКоличество/ТоварнаяСтрока.Коэффициент;
					Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(Объект, ТоварнаяСтрока, ПараметрыДействия);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ШтрихкодированиеМПКлиентСервер.ЭтоКодЛогистическойУпаковки(КодМарки, ШтрихКод, РезультатРазбора) Тогда
		
		GTIN                    = РезультатРазбора.СоставКодаМаркировки.GTIN;
		СерийныйНомер           = РезультатРазбора.СоставКодаМаркировки.СерийныйНомер;
		НормализованныйКодМарки = РезультатРазбора.НормализованныйКодМаркировки;
		
		ЗначениеШтрихКода = ШтрихкодированиеМПКлиентСервер.КодМаркировкиДляПередачиИСМП(КодМарки);
		
		НайденнаяСтрока = НайтиСтрокуМарки(Объект, GTIN, СерийныйНомер);
		Если НайденнаяСтрока = Неопределено Тогда
			ПараметрыДействия.Вставить("ШтрихКод", ШтрихКод);
			ШтрихкодированиеВызовСервера.ВыполнитьПоискОбъектовПоШтрихкодуУДокумента(Форма, Объект, ПараметрыДействия);
			СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеЧислилась;
		Иначе
			Если НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеПроверялась ИЛИ 
				НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.Отсутствует Тогда
				НайденнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.ВНаличии;
			КонецЕсли;
			
			ТоварнаяСтрока = НайтиТоварнуюСтрокуПоИдентификатору(Объект, НайденнаяСтрока.ИдентификаторСтроки);
			Если НЕ ТоварнаяСтрока = Неопределено Тогда
				ФактическоеКоличество = Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, СтатусПроверки", НайденнаяСтрока.ИдентификаторСтроки, Перечисления.СтатусыПроверкиМаркированнойПродукции.Отсутствует)).Количество();
				ФактическоеКоличество = ФактическоеКоличество + Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, СтатусПроверки", НайденнаяСтрока.ИдентификаторСтроки, Перечисления.СтатусыПроверкиМаркированнойПродукции.ВНаличии)).Количество();
				
				КоэффициентШтрихКода = ПолучитьКоэффициентШтрихКода(ШтрихКод);
				
				ФактическоеКоличество = ФактическоеКоличество*КоэффициентШтрихКода;
				Количество = ТоварнаяСтрока.Количество*ТоварнаяСтрока.Коэффициент;
				
				НовоеКоличество = Макс(Количество, ФактическоеКоличество);
				Если НЕ НовоеКоличество = Количество Тогда
					ТоварнаяСтрока.Количество = НовоеКоличество/ТоварнаяСтрока.Коэффициент;
					Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(Объект, ТоварнаяСтрока, ПараметрыДействия);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	//ИначеЕсли Объект.ПолученИзЕГАИС И глВнешнийМодульОбменаЕГАИС.ЭтоКодМаркировкиАлкоПродукции(КодМарки) Тогда
		
		//глВнешнийМодульОбменаЕГАИС.ВнешнееСобытиеДляПоступления(Форма, Источник, Событие, КодМарки);
		//дкВывестиЗаголовокСуммаДокумента(Форма);
		
	//ИначеЕсли Объект.ПолученИзЕГАИС И глВнешнийМодульОбменаЕГАИС.ЭтоКодУпаковкиАлкоПродукции(КодМарки) Тогда
		
		//глВнешнийМодульОбменаЕГАИС.ВнешнееСобытиеДляПоступления(Форма, Источник, Событие, КодМарки);
		//дкВывестиЗаголовокСуммаДокумента(Форма);
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") И ТипЗнч(ПараметрыДействия.ВыбранноеЗначение) = Тип("Структура") Тогда
		ПараметрыДействия.ВыбранноеЗначение.Вставить("КодМарки", КодМарки);
		ПараметрыДействия.ВыбранноеЗначение.Вставить("СерийныйНомер", СерийныйНомер);
		ПараметрыДействия.ВыбранноеЗначение.Вставить("GTIN", GTIN);
		ПараметрыДействия.ВыбранноеЗначение.Вставить("НормализованныйКодМарки", НормализованныйКодМарки);
		Если ЗначениеЗаполнено(СтатусПроверки) Тогда
			ПараметрыДействия.ВыбранноеЗначение.Вставить("СтатусПроверки", СтатусПроверки);
		КонецЕсли;
		ПараметрыДействия.ВыбранноеЗначение.Вставить("ПоОсновнойЕдинице", Истина);
	ИначеЕсли НайденнаяСтрока = Неопределено Тогда
		ВывестиСообщение(НСтр("ru = 'По штрихкоду <%1> не найдена номенклатура'"), УникальныйИдентификаторФормы,,,, ШтрихКод);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОбработкаМаркиРеализации(Форма, Объект, КодМарки, ПараметрыДействия) Экспорт
	
	Если ПараметрыДействия.Свойство("ДоступныеПоля") Тогда
		ПараметрыДействия.ДоступныеПоля.Вставить("ВыборТовара");
	Иначе
		ДоступныеПоля = Новый Структура;
		ДоступныеПоля.Вставить("ВыборТовара");
		ПараметрыДействия.Вставить("ДоступныеПоля", ДоступныеПоля);
	КонецЕсли;
	
	УникальныйИдентификаторФормы = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "УникальныйИдентификаторФормы", "");
	Если ПустаяСтрока(УникальныйИдентификаторФормы) Тогда
		УникальныйИдентификаторФормы = ?(Форма = Неопределено, Неопределено, Форма.УникальныйИдентификатор);
	КонецЕсли;
	
	СтрокиМарка = Объект.Марки.НайтиСтроки(Новый Структура("КодМарки", КодМарки));
	Если СтрокиМарка.Количество() > 0 Тогда
		ВывестиСообщение(НСтр("ru = 'Данная марка уже внесена в документ'"), УникальныйИдентификаторФормы);
		ИдентификаторСтроки = СтрокиМарка[0].ПолучитьИдентификатор();
		Если НЕ Форма = Неопределено Тогда
			Форма.Элементы.Марки.ТекущаяСтрока = ИдентификаторСтроки;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ШтрихКод           = "";
	МРЦ                = 0;
	СерийныйНомер      = "";
	Результат          = Ложь;
	СтрокаНоменклатура = Неопределено;
	Если ШтрихкодированиеМПКлиентСервер.ЭтоКодМаркировкиТабачнойПачки(КодМарки, ШтрихКод, МРЦ) Тогда
		
		ПараметрыДействия.Вставить("ШтрихКод", ШтрихКод);
		ШтрихкодированиеВызовСервера.ВыполнитьПоискОбъектовПоШтрихкодуУДокумента(Форма, Объект, ПараметрыДействия);
		
	ИначеЕсли ШтрихкодированиеМПКлиентСервер.ЭтоКодМаркировкиБлока(КодМарки, ШтрихКод, МРЦ, СерийныйНомер) Тогда
		
		ПараметрыДействия.Вставить("ШтрихКод", ШтрихКод);
		ШтрихкодированиеВызовСервера.ВыполнитьПоискОбъектовПоШтрихкодуУДокумента(Форма, Объект, ПараметрыДействия);
		
	ИначеЕсли ШтрихкодированиеМПКлиентСервер.ЭтоКодМаркировкиПотребительскойУпаковки(КодМарки, ШтрихКод, СерийныйНомер) Тогда
		
		ПараметрыДействия.Вставить("ШтрихКод", ШтрихКод);
		ШтрихкодированиеВызовСервера.ВыполнитьПоискОбъектовПоШтрихкодуУДокумента(Форма, Объект, ПараметрыДействия);
		
	ИначеЕсли ШтрихкодированиеМПКлиентСервер.ЭтоКодЛогистическойУпаковки(КодМарки, ШтрихКод) Тогда
		
		ПараметрыДействия.Вставить("ШтрихКод", ШтрихКод);
		ШтрихкодированиеВызовСервера.ВыполнитьПоискОбъектовПоШтрихкодуУДокумента(Форма, Объект, ПараметрыДействия);
		
	ИначеЕсли ШтрихкодированиеМПКлиентСервер.ЭтоКодМаркировкиАлкоПродукции(КодМарки) Тогда
		
		//глВнешнийМодульОбменаЕГАИС.ВнешнееСобытиеЕГАИС(Форма, Источник, Событие, КодМарки);
		
	ИначеЕсли ШтрихкодированиеМПКлиентСервер.ЭтоКодУпаковкиАлкоПродукции(КодМарки) Тогда
		
		//глВнешнийМодульОбменаЕГАИС.ВнешнееСобытиеЕГАИС(Форма, Источник, Событие, КодМарки);
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") И ТипЗнч(ПараметрыДействия.ВыбранноеЗначение) = Тип("Структура") Тогда
		//И ЗначениеЗаполнено(ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия.ВыбранноеЗначение, "Объект", Неопределено))
		ПараметрыДействия.ВыбранноеЗначение.Вставить("КодМарки", КодМарки);
		ПараметрыДействия.ВыбранноеЗначение.Вставить("ПоОсновнойЕдинице", Истина);
		//Если ПустаяСтрока(СтрокаНоменклатура.ИдентификаторСтроки) Тогда
		//	СтрокаНоменклатура.ИдентификаторСтроки = Форма.ИдентификаторСтроки;
		//	Форма.ИдентификаторСтроки = Форма.ИдентификаторСтроки + 1;
		//КонецЕсли;
		
		//НоваяСтрока = Форма.Марки.Добавить();
		//НоваяСтрока.КодМарки            = КодМарки;
		//НоваяСтрока.ИдентификаторСтроки = СтрокаНоменклатура.ИдентификаторСтроки;
	Иначе
		ВывестиСообщение(НСтр("ru = 'По штрихкоду <%1> не найдена номенклатура'"), УникальныйИдентификаторФормы,,,, ШтрихКод);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

//Функция ОбработкаМарки(Форма, Источник, Событие, Знач КодМарки, ПроверятьДоступностьФормы) Экспорт
Функция ОбработкаМарки(Форма, Объект, ПараметрыДействия) Экспорт
	
	КодМарки = ПараметрыДействия.ШтрихКод;
	
	КодМарки = СтрЗаменить(КодМарки, "\u001D", "");
	КодМарки = СтрЗаменить(КодМарки, Символ(29), "");
	
	Результат = Ложь;
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		Результат = ОбработкаМаркиРеализации(Форма, Объект, КодМарки, ПараметрыДействия);
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
		Результат = ОбработкаМаркиРеализации(Форма, Объект, КодМарки, ПараметрыДействия);
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		Результат = ОбработкаМаркиПоступления(Форма, Объект, КодМарки, ПараметрыДействия);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Служебные


Функция ШаблонРазбораКодаМаркировки(ПараметрыРазбораКодаМаркировки, Настройки)
	
	ИмяКолонкиПоиска = "Длина";
	
	Отбор = Новый Структура;
	
	Если ПараметрыРазбораКодаМаркировки.НачинаетсяСоСкобки Тогда
		
		ИмяКолонкиПоиска = "ДлинаСоСкобкой";
		
	ИначеЕсли ПараметрыРазбораКодаМаркировки.СодержитGS1 Тогда
		
		ИмяКолонкиПоиска = "ДлинаСоСкобкой";
		
		КоличествоЭлементов = ПараметрыРазбораКодаМаркировки.РезультатРазбора.ДанныеШтрихкода.Количество();
		
		Отбор.Вставить("КоличествоЭлементов", КоличествоЭлементов);
		
	КонецЕсли;
	
	Отбор.Вставить(ИмяКолонкиПоиска, ПараметрыРазбораКодаМаркировки.ДлинаКодаМаркировки);
	
	НайденныеШаблоны = Настройки.ШаблоныКодовМаркировки.НайтиСтроки(Отбор);
	
	Возврат НайденныеШаблоны;
	
КонецФункции

Функция ЭтоНеформализованныйКодМаркировки(ПараметрыРазбораКодаМаркировки, Настройки, ДанныеРезультата)
	
	ВидПродукции = Перечисления.ВидыМаркируемойПродукции.Табачная;
	
	Если Настройки.ДоступныеВидыПродукции.Найти(ВидПродукции) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ФильтрПоВидуПродукции = ПараметрыРазбораКодаМаркировки.ФильтрПоВидуПродукции;
	
	Если (ПараметрыРазбораКодаМаркировки.НачинаетсяСоСкобки Или ПараметрыРазбораКодаМаркировки.СодержитGS1)
		И ФильтрПоВидуПродукции.Использовать
		И ФильтрПоВидуПродукции.ВидыПродукции.Количество() = 1
		И ФильтрПоВидуПродукции.ВидыПродукции[0] = ВидПродукции Тогда
		
		Если ПараметрыРазбораКодаМаркировки.НачинаетсяСоСкобки Тогда
			РезультатРазбора = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьСтрокуШтрихкодаGS1(ПараметрыРазбораКодаМаркировки.КодМаркировки);
			Если Не РезультатРазбора.Разобран Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ВидыПродукции = Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидПродукции));
		
		ТипШтрихкодаИВидУпаковки = ТипШтрихкодаИВидУпаковки();
		ТипШтрихкодаИВидУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_128;
		ТипШтрихкодаИВидУпаковки.ВидУпаковки  = Перечисления.ВидыУпаковокМаркировки.Логистическая;
		
		СоставКодаМаркировки = НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки);
		
		ДанныеРезультата = НовыйРезультатРазбораКодаМаркировки();
		ДанныеРезультата.КодМаркировки        = ПараметрыРазбораКодаМаркировки.КодМаркировки;
		ДанныеРезультата.ТипШтрихкода         = ТипШтрихкодаИВидУпаковки.ТипШтрихкода;
		ДанныеРезультата.ВидУпаковки          = ТипШтрихкодаИВидУпаковки.ВидУпаковки;
		ДанныеРезультата.ВидыПродукции        = ВидыПродукции;
		ДанныеРезультата.СоставКодаМаркировки = СоставКодаМаркировки;
		
		НормализованныйКодМаркировки = НормализоватьКодМаркировки(
			ДанныеРезультата, ВидПродукции);
		
		ДанныеРезультата.НормализованныйКодМаркировки = НормализованныйКодМаркировки;
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ОбработатьРезультатНесколькихШаблонов(Результат, ДанныеРезультата)
	
	// Для табака может подойти два шаблона: GTIN+Серия+КодПроверки и GTIN+Серия+МРЦ, берем с МРЦ
	Если Результат.Количество() = 2
		И Результат[0].ВидыПродукции[0] = Перечисления.ВидыМаркируемойПродукции.Табачная
		И Результат[1].ВидыПродукции[0] = Перечисления.ВидыМаркируемойПродукции.Табачная Тогда
		
		Если ЗначениеЗаполнено(Результат[0].СоставКодаМаркировки.МРЦСтрокой) Тогда
			ДанныеРезультата = Результат[0];
			Возврат Истина;
		ИначеЕсли ЗначениеЗаполнено(Результат[1].СоставКодаМаркировки.МРЦСтрокой) Тогда
			ДанныеРезультата = Результат[1];
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ВидыПродукцииПоФильтру(ФильтрПоВидуПродукции, ВидыПродукции)
	
	Если Не ФильтрПоВидуПродукции.Использовать Тогда
		Возврат Новый ФиксированныйМассив(ВидыПродукции);
	КонецЕсли;
	
	Результат = Новый Массив;
	Для Каждого ВидПродукции Из ФильтрПоВидуПродукции.ВидыПродукции Цикл
		Если ВидыПродукции.Найти(ВидПродукции) <> Неопределено Тогда
			Результат.Добавить(ВидПродукции);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

#КонецОбласти

#Область Маркировка

Функция РазобратьКодМаркировки(Знач ДанныеДляРазбора, ВидыПродукции = Неопределено, ПримечаниеКРезультатуРазбора = Неопределено) Экспорт
	
	ПримечаниеКРезультатуРазбора = Новый Структура("ТекстОшибки, РезультатРазбора", "", Неопределено);
	
	Настройки = ШтрихкодированиеМПВызовСервераПовтИсп.НастройкиРазбораКодаМаркировки();
	
	Если Настройки.ДоступныеВидыПродукции.Количество() = 0 Тогда
		ПримечаниеКРезультатуРазбора.ТекстОшибки = НСтр("ru = 'Учет маркируемой продукции не ведется.'");
		Возврат Неопределено;
	КонецЕсли;
	
	ФильтрПоВидуПродукции = Новый Структура("Использовать, ВидыПродукции", Ложь, Неопределено);
	Если ВидыПродукции <> Неопределено Тогда
		ФильтрПоВидуПродукции.Использовать = Истина;
		Если ТипЗнч(ВидыПродукции) = Тип("ПеречислениеСсылка.ВидыМаркируемойПродукции") Тогда
			ФильтрПоВидуПродукции.ВидыПродукции = Новый ФиксированныйМассив(
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидыПродукции));
		Иначе
			ФильтрПоВидуПродукции.ВидыПродукции = Новый ФиксированныйМассив(ВидыПродукции);
		КонецЕсли;
	КонецЕсли;
	
	РезультатРазбора = Неопределено;
	Если ТипЗнч(ДанныеДляРазбора) = Тип("Строка") Тогда
		Если НайтиНедопустимыеСимволыXML(ДанныеДляРазбора) > 0 Тогда
			РезультатРазбора = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьСтрокуШтрихкодаGS1(ДанныеДляРазбора);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеДляРазбора) = Тип("Структура") Тогда
		РезультатРазбора = ДанныеДляРазбора;
	Иначе
		ПримечаниеКРезультатуРазбора.ТекстОшибки = НСтр("ru = 'Данные для разбора некорректны.'");
		Возврат Неопределено;
	КонецЕсли;
	
	НачинаетсяСоСкобки = Ложь;
	СодержитGS1        = Ложь;
	
	Если РезультатРазбора = Неопределено Тогда
		НачинаетсяСоСкобки = СтрНачинаетсяС(ДанныеДляРазбора, "(");
		КодМаркировки      = ДанныеДляРазбора;
	Иначе
		Если Не РезультатРазбора.Разобран Тогда
			ПримечаниеКРезультатуРазбора.ТекстОшибки = РезультатРазбора.ОписаниеОшибки;
			Возврат Неопределено;
		КонецЕсли;
		СодержитGS1    = Истина;
		КодМаркировки  = РезультатРазбора.ПредставлениеШтрихкода;
	КонецЕсли;
	
	ДлинаКодаМаркировки = СтрДлина(КодМаркировки);
	
	ПараметрыРазбораКодаМаркировки = Новый Структура;
	ПараметрыРазбораКодаМаркировки.Вставить("КодМаркировки",         КодМаркировки);
	ПараметрыРазбораКодаМаркировки.Вставить("НачинаетсяСоСкобки",    НачинаетсяСоСкобки);
	ПараметрыРазбораКодаМаркировки.Вставить("СодержитGS1",           СодержитGS1);
	ПараметрыРазбораКодаМаркировки.Вставить("РезультатРазбора",      РезультатРазбора);
	ПараметрыРазбораКодаМаркировки.Вставить("ДлинаКодаМаркировки",   ДлинаКодаМаркировки);
	ПараметрыРазбораКодаМаркировки.Вставить("ФильтрПоВидуПродукции", ФильтрПоВидуПродукции);
	
	НайденныеШаблоны = ШаблонРазбораКодаМаркировки(ПараметрыРазбораКодаМаркировки, Настройки);
	
	Результат = Новый Массив;
	
	Для Каждого ШаблонКодаМаркировки Из НайденныеШаблоны Цикл
		
		ДанныеШаблона = Настройки.ШаблоныИОписанияВидовПродукции[ШаблонКодаМаркировки.Шаблон];
		
		СоставКодаМаркировки = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеШаблона.СоставКодаМаркировки);
		
		ПараметрыОписанияКодаМаркировки = Новый Структура;
		ПараметрыОписанияКодаМаркировки.Вставить("ОписаниеКодаМаркировки",      ДанныеШаблона.ОписаниеКодаМаркировки);
		ПараметрыОписанияКодаМаркировки.Вставить("ОбщиеМодулиШтрихкодирования", ДанныеШаблона.ОбщиеМодулиШтрихкодирования);
		ПараметрыОписанияКодаМаркировки.Вставить("Шаблон",                      ШаблонКодаМаркировки.Шаблон);
		ПараметрыОписанияКодаМаркировки.Вставить("ТипШтрихкода",                ШаблонКодаМаркировки.ТипШтрихкода);
		ПараметрыОписанияКодаМаркировки.Вставить("ВидУпаковки",                 ШаблонКодаМаркировки.ВидУпаковки);
		
		ЗначенияЭлементовКМ = Новый Соответствие;
		
		Если Не КодМаркировкиСоответствуетОписанию(ПараметрыРазбораКодаМаркировки, ПараметрыОписанияКодаМаркировки, СоставКодаМаркировки, ЗначенияЭлементовКМ) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеРезультата = НовыйРезультатРазбораКодаМаркировки();
		ДанныеРезультата.КодМаркировки        = КодМаркировки;
		ДанныеРезультата.ТипШтрихкода         = ШаблонКодаМаркировки.ТипШтрихкода;
		ДанныеРезультата.ВидУпаковки          = ШаблонКодаМаркировки.ВидУпаковки;
		ДанныеРезультата.ВидыПродукции        = ДанныеШаблона.ВидыПродукции;
		ДанныеРезультата.СоставКодаМаркировки = СоставКодаМаркировки;
		
		НормализованныйКодМаркировки = НормализоватьКодМаркировки(ДанныеРезультата, ДанныеШаблона.ВидыПродукции[0]);
		
		ДанныеРезультата.НормализованныйКодМаркировки = НормализованныйКодМаркировки;
		
		Результат.Добавить(ДанныеРезультата);
		
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		
		ДанныеРезультата = Неопределено;
		Если ЭтоНеформализованныйКодМаркировки(ПараметрыРазбораКодаМаркировки, Настройки, ДанныеРезультата) Тогда
			Возврат ДанныеРезультата;
		КонецЕсли;
		
		ПримечаниеКРезультатуРазбора.ТекстОшибки = НСтр("ru = 'Код маркировки не соответствует ни одному шаблону.'");
		Возврат Неопределено;
		
	КонецЕсли;
	
	РезультатПоФильтру = Новый Массив;
	
	Для Каждого ДанныеРезультата Из Результат Цикл
		
		ВидыПродукцииПоФильтру = ВидыПродукцииПоФильтру(ФильтрПоВидуПродукции, ДанныеРезультата.ВидыПродукции);
		
		Если ВидыПродукцииПоФильтру.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеРезультата.ВидыПродукции = ВидыПродукцииПоФильтру;
		
		РезультатПоФильтру.Добавить(ДанныеРезультата);
		
	КонецЦикла;
	
	Если РезультатПоФильтру.Количество() = 1 Тогда
		
		Возврат РезультатПоФильтру[0];
		
	ИначеЕсли РезультатПоФильтру.Количество() > 1 Тогда
		
		ДанныеРезультата = Неопределено;
		Если ОбработатьРезультатНесколькихШаблонов(РезультатПоФильтру, ДанныеРезультата) Тогда
			Возврат ДанныеРезультата;
		КонецЕсли;
		
		// К примеру логистические укаковки длиной 18 символов для ЕГАИС и ИСМП
		ПримечаниеКРезультатуРазбора.ТекстОшибки = НСтр("ru = 'Код маркировки соответствует нескольким шаблонам'");
		ПримечаниеКРезультатуРазбора.РезультатРазбора = РезультатПоФильтру;
		Возврат Неопределено;
		
	Иначе
		
		ПримечаниеКРезультатуРазбора.ТекстОшибки = НСтр("ru = 'Код маркировки соответствует другим видам продукции'");
		ПримечаниеКРезультатуРазбора.РезультатРазбора = Результат;
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Инициализировать параметры нормализации кода маркировки
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * ВключатьМРЦ - Булево - Признак включения МРЦ
// * ИмяСвойстваКодМаркировки - Строка - Имя свойства для получения кода маркировки
Функция ПараметрыНормализацииКодаМаркировки() Экспорт
	
	ПараметрыНормализации = Новый Структура;
	ПараметрыНормализации.Вставить("ИмяСвойстваКодМаркировки", "КодМаркировки");
	ПараметрыНормализации.Вставить("НачинаетсяСоСкобки",        Истина);
	ПараметрыНормализации.Вставить("ВключатьМРЦ",               Истина); // Табак
	
	Возврат ПараметрыНормализации;
	
КонецФункции

Функция НормализоватьКодМаркировки(РезультатРазбора, ВидПродукции, ПараметрыНормализации = Неопределено) Экспорт
	
	Если ПараметрыНормализации = Неопределено Тогда
		ПараметрыНормализации = ПараметрыНормализацииКодаМаркировки();
	КонецЕсли;
	
	Если ВидПродукции = Перечисления.ВидыМаркируемойПродукции.Табачная
		И РезультатРазбора.ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Логистическая
		И РезультатРазбора.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_128 Тогда
		
		Возврат РезультатРазбора[ПараметрыНормализации.ИмяСвойстваКодМаркировки];
		
	ИначеЕсли РезультатРазбора.ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Логистическая Тогда
		
		Если ПараметрыНормализации.НачинаетсяСоСкобки Тогда
			Возврат СтрШаблон("(00)%1", Прав(РезультатРазбора[ПараметрыНормализации.ИмяСвойстваКодМаркировки], 18));
		КонецЕсли;
		
		Возврат СтрШаблон("00%1", Прав(РезультатРазбора[ПараметрыНормализации.ИмяСвойстваКодМаркировки], 18));
		
	КонецЕсли;
	
	Если ВидПродукции = Перечисления.ВидыМаркируемойПродукции.Табачная Тогда
		
		ВключатьМРЦ = ПараметрыНормализации.ВключатьМРЦ
		            И ЗначениеЗаполнено(РезультатРазбора.СоставКодаМаркировки.МРЦСтрокой);
		
		Если РезультатРазбора.ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Потребительская Тогда
			
			Если ВключатьМРЦ Тогда
				
				Возврат СтрШаблон("%1%2%3",
					РезультатРазбора.СоставКодаМаркировки.GTIN,
					РезультатРазбора.СоставКодаМаркировки.СерийныйНомер,
					РезультатРазбора.СоставКодаМаркировки.МРЦСтрокой);
				
			Иначе
				
				Возврат СтрШаблон("%1%2",
					РезультатРазбора.СоставКодаМаркировки.GTIN,
					РезультатРазбора.СоставКодаМаркировки.СерийныйНомер);
				
			КонецЕсли;
			
		Иначе
			
			Если ВключатьМРЦ Тогда
				
				Если ПараметрыНормализации.НачинаетсяСоСкобки Тогда
					Возврат СтрШаблон("(01)%1(21)%2(8005)%3",
						РезультатРазбора.СоставКодаМаркировки.GTIN,
						РезультатРазбора.СоставКодаМаркировки.СерийныйНомер,
						РезультатРазбора.СоставКодаМаркировки.МРЦСтрокой);
				КонецЕсли;
				
				ЭлементыКМ = Новый Массив;
				ЭлементыКМ.Добавить("01");
				ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.GTIN);
				ЭлементыКМ.Добавить("21");
				ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.СерийныйНомер);
				ЭлементыКМ.Добавить("8005");
				ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.МРЦСтрокой);
				Возврат СтрСоединить(ЭлементыКМ);
				
			Иначе
				
				Если ПараметрыНормализации.НачинаетсяСоСкобки Тогда
					Возврат СтрШаблон("(01)%1(21)%2",
						РезультатРазбора.СоставКодаМаркировки.GTIN,
						РезультатРазбора.СоставКодаМаркировки.СерийныйНомер);
				КонецЕсли;
				
				ЭлементыКМ = Новый Массив;
				ЭлементыКМ.Добавить("01");
				ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.GTIN);
				ЭлементыКМ.Добавить("21");
				ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.СерийныйНомер);
				Возврат СтрСоединить(ЭлементыКМ);
				
			КонецЕсли;
			
			
		КонецЕсли;
		
	ИначеЕсли ВидПродукции = Перечисления.ВидыМаркируемойПродукции.Обувная Тогда
		
		ВключатьКодТНВЭД = РезультатРазбора.СоставКодаМаркировки.Свойство("КодТНВЭД")
		                 И ЗначениеЗаполнено(РезультатРазбора.СоставКодаМаркировки.КодТНВЭД);
		
		Если ВключатьКодТНВЭД Тогда
			
			Если ПараметрыНормализации.НачинаетсяСоСкобки Тогда
				Возврат СтрШаблон("(01)%1(21)%2(240)%3",
					РезультатРазбора.СоставКодаМаркировки.GTIN,
					РезультатРазбора.СоставКодаМаркировки.СерийныйНомер,
					РезультатРазбора.СоставКодаМаркировки.КодТНВЭД);
			КонецЕсли;
			
			ЭлементыКМ = Новый Массив;
			ЭлементыКМ.Добавить("01");
			ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.GTIN);
			ЭлементыКМ.Добавить("21");
			ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.СерийныйНомер);
			ЭлементыКМ.Добавить("240");
			ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.КодТНВЭД);
			Возврат СтрСоединить(ЭлементыКМ);
			
		Иначе
			
			Если ПараметрыНормализации.НачинаетсяСоСкобки Тогда
				Возврат СтрШаблон("(01)%1(21)%2",
					РезультатРазбора.СоставКодаМаркировки.GTIN,
					РезультатРазбора.СоставКодаМаркировки.СерийныйНомер);
			КонецЕсли;
			
			ЭлементыКМ = Новый Массив;
			ЭлементыКМ.Добавить("01");
			ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.GTIN);
			ЭлементыКМ.Добавить("21");
			ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.СерийныйНомер);
			Возврат СтрСоединить(ЭлементыКМ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыНормализации.НачинаетсяСоСкобки Тогда
		Возврат СтрШаблон("(01)%1(21)%2",
			РезультатРазбора.СоставКодаМаркировки.GTIN,
			РезультатРазбора.СоставКодаМаркировки.СерийныйНомер);
	КонецЕсли;
	
	ЭлементыКМ = Новый Массив;
	ЭлементыКМ.Добавить("01");
	ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.GTIN);
	ЭлементыКМ.Добавить("21");
	ЭлементыКМ.Добавить(РезультатРазбора.СоставКодаМаркировки.СерийныйНомер);
	Возврат СтрСоединить(ЭлементыКМ);
	
КонецФункции

Функция КодМаркировкиСоответствуетОписанию(ПараметрыКодаМаркировки, ПараметрыОписанияКодаМаркировки, СоставКодаМаркировки, ЗначенияЭлементовКМ)
	
	КодМаркировки      = ПараметрыКодаМаркировки.КодМаркировки;
	НачинаетсяСоСкобки = ПараметрыКодаМаркировки.НачинаетсяСоСкобки;
	СодержитGS1        = ПараметрыКодаМаркировки.СодержитGS1;
	РезультатРазбора   = ПараметрыКодаМаркировки.РезультатРазбора;
	
	БазовыйКоличествоДопСимволов = ?(НачинаетсяСоСкобки, 2, 0); // с учетом символов "(" и ")"
	
	Для Каждого ОписаниеЭлементаКМ Из ПараметрыОписанияКодаМаркировки.ОписаниеКодаМаркировки Цикл
		
		Значение = Неопределено;
		Если СодержитGS1 Тогда
			Если РезультатРазбора.ДанныеШтрихкода[ОписаниеЭлементаКМ.Код] = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			Значение = РезультатРазбора.ДанныеШтрихкода[ОписаниеЭлементаКМ.Код].Значение;
		Иначе
			КоличествоДопСимволов = БазовыйКоличествоДопСимволов;
			ИдентификаторСДопСимволами = Лев(КодМаркировки, СтрДлина(ОписаниеЭлементаКМ.Код) + КоличествоДопСимволов);
			
			Если НачинаетсяСоСкобки Тогда
				ЭтоПравильныйИдентификатор = (ИдентификаторСДопСимволами = СтрШаблон("(%1)", ОписаниеЭлементаКМ.Код));
			Иначе
				ЭтоПравильныйИдентификатор = (ИдентификаторСДопСимволами = ОписаниеЭлементаКМ.Код);
			КонецЕсли;
			Если Не ЭтоПравильныйИдентификатор Тогда
				Возврат Ложь;
			КонецЕсли;
			Значение = Сред(КодМаркировки, СтрДлина(ОписаниеЭлементаКМ.Код) + КоличествоДопСимволов + 1, ОписаниеЭлементаКМ.Длина);
		КонецЕсли;
		
		Если СтрДлина(Значение) <> ОписаниеЭлементаКМ.Длина Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеЭлементаКМ.Алфавит)
			И Не ШтрихкодированиеМПКлиентСервер.КодСоответствуетАлфавиту(Значение, ОписаниеЭлементаКМ.Алфавит) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если Не ЭлементКодаМаркировкиСоответствуетОписанию(Значение, ОписаниеЭлементаКМ, СоставКодаМаркировки, ПараметрыОписанияКодаМаркировки) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ЗначенияЭлементовКМ[ОписаниеЭлементаКМ.Имя] = Значение;
		
		Если Не СодержитGS1 Тогда
			КодМаркировки = Сред(КодМаркировки, СтрДлина(ОписаниеЭлементаКМ.Код) + КоличествоДопСимволов + ОписаниеЭлементаКМ.Длина + 1);
			Если КодМаркировки = "" Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не СодержитGS1 И ЗначениеЗаполнено(КодМаркировки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЭлементКодаМаркировкиСоответствуетОписанию(Знач Значение, ОписаниеЭлементаКМ, СоставКодаМаркировки, ПараметрыОписанияКодаМаркировки)
	
	Если ОписаниеЭлементаКМ.Имя = "GTIN" Тогда
		
		ЗначениеEAN = EANПоКодуМаркировки(Значение);
		Если ЗначениеEAN = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		EANОписаниеЭлементаКМ = ОписаниеЭлементаКодаМаркировки("", "EAN", 0);
		ЗаполнитьСоставКодаМаркировки(СоставКодаМаркировки, EANОписаниеЭлементаКМ, ЗначениеEAN);
		
	ИначеЕсли ОписаниеЭлементаКМ.Имя = "SSCC" Тогда
		
		КонтрольноеЧисло = ШтрихкодыУпаковокКлиентСервер.КонтрольноеЧислоSSCC(Лев(Значение, ОписаниеЭлементаКМ.Длина - 1));
		
		Возврат КонтрольноеЧисло =  Число(Прав(Значение, 1));
		
	ИначеЕсли ОписаниеЭлементаКМ.Имя = "МРЦСтрокой" Тогда
		
		МРЦ = 0;
		
		Если Не ЭлементКодаМаркировкиСоответствуетОписаниюМРЦ(Значение, ОписаниеЭлементаКМ, ПараметрыОписанияКодаМаркировки, МРЦ) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		МРЦОписаниеЭлементаКМ = ОписаниеЭлементаКодаМаркировки("", "МРЦ", "");
		ЗаполнитьСоставКодаМаркировки(СоставКодаМаркировки, МРЦОписаниеЭлементаКМ, МРЦ);
		
	КонецЕсли;
	
	ПреобразоватьЗначениеДляЗаполненияСоставаКодаМаркировки(ПараметрыОписанияКодаМаркировки, СоставКодаМаркировки, ОписаниеЭлементаКМ, Значение);
	
	ЗаполнитьСоставКодаМаркировки(СоставКодаМаркировки, ОписаниеЭлементаКМ, Значение);
	
	Возврат Истина;
	
КонецФункции

Процедура ПреобразоватьЗначениеДляЗаполненияСоставаКодаМаркировки(ПараметрыОписанияКодаМаркировки, СоставКодаМаркировки, ОписаниеЭлементаКМ, Значение) Экспорт
	
	Если СоставКодаМаркировки = Неопределено Или Не СоставКодаМаркировки.Свойство(ОписаниеЭлементаКМ.Имя) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция ЭлементКодаМаркировкиСоответствуетОписаниюМРЦ(Значение, ОписаниеЭлементаКМ, ПараметрыОписанияКодаМаркировки, МРЦ = 0)
	
	Если ПараметрыОписанияКодаМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Потребительская Тогда
		
		МРЦ = 0;
		
		Для Индекс = 1 По СтрДлина(Значение) Цикл
			Символ = Сред(Значение, Индекс, 1);
			ИндексСимвола = СтрНайти(ОписаниеЭлементаКМ.Алфавит, Символ) - 1;
			Если ИндексСимвола < 0 Тогда
				Возврат Ложь;
			КонецЕсли;
			МРЦ = МРЦ + Pow(80, 4 - Индекс) * ИндексСимвола;
		КонецЦикла;
		
		// Если цена <= 5000 и нет копеек, то высокая вероятность, что это реальное МРЦ.
		Если МРЦ > 500000 Или МРЦ % 100 > 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		
		МРЦ = Число(Значение);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МРЦ) Тогда
		МРЦ = МРЦ / 100;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗаполнитьСоставКодаМаркировки(СоставКодаМаркировки, ОписаниеЭлементаКМ, Значение) Экспорт
	
	Если СоставКодаМаркировки = Неопределено Или Не СоставКодаМаркировки.Свойство(ОписаниеЭлементаКМ.Имя) Тогда
		Возврат;
	КонецЕсли;
	
	СоставКодаМаркировки[ОписаниеЭлементаКМ.Имя] = Значение;
	
КонецПроцедуры

Функция НовыйРезультатРазбораКодаМаркировки() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("КодМаркировки",                "");
	Результат.Вставить("НормализованныйКодМаркировки", "");
	Результат.Вставить("ТипШтрихкода",                 Перечисления.ТипыШтрихкодов.ПустаяСсылка());
	Результат.Вставить("ВидУпаковки",                  Перечисления.ВидыУпаковокМаркировки.ПустаяСсылка());
	Результат.Вставить("ВидыПродукции",                Неопределено);
	Результат.Вставить("СоставКодаМаркировки",         Неопределено);
	Возврат Результат;
КонецФункции

Функция НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки) Экспорт
	
	СоставКодаМаркировки = Новый Структура;
	
	Если ТипШтрихкодаИВидУпаковки.ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Потребительская
		Или ТипШтрихкодаИВидУпаковки.ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Групповая Тогда
		
		СоставКодаМаркировки.Вставить("GTIN",          "");
		СоставКодаМаркировки.Вставить("EAN",           "");
		СоставКодаМаркировки.Вставить("СерийныйНомер", "");
		
	ИначеЕсли ТипШтрихкодаИВидУпаковки.ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Логистическая
		И ТипШтрихкодаИВидУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.SSCC Тогда
		
		СоставКодаМаркировки.Вставить("SSCC", "");
		
	КонецЕсли;
	
	Возврат СоставКодаМаркировки;
	
КонецФункции

Процедура ДополнитьНастройкиРазбораКодаМаркировки(НастройкиРазбораКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля) Экспорт
	
	Если ВидПродукции = Перечисления.ВидыМаркируемойПродукции.Табачная Тогда
		
		ОписаниеКодаМаркировкиТабачногоБлока(НастройкиРазбораКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля);
		
		ОписаниеКодаМаркировкиТабачнойПачки(НастройкиРазбораКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля);
		
	ИначеЕсли ВидПродукции = Перечисления.ВидыМаркируемойПродукции.Обувная Тогда
		
		ОписаниеКодаМаркировкиОбуви(НастройкиРазбораКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	// Упаковка
	ОписаниеКодаМаркировкиЛогистическаяУпаковка20(НастройкиРазбораКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля);
	
	Если ВидПродукции <> Перечисления.ВидыМаркируемойПродукции.Табачная Тогда
		
		ОписаниеКодаМаркировкиЛогистическаяУпаковка18(НастройкиРазбораКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


// Формирует описание кода маркировки для табачного блока
Процедура ОписаниеКодаМаркировкиТабачногоБлока(НастройкиРазбораКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля)
	
	Алфавит = НастройкиРазбораКодаМаркировки.Алфавит;
	
	ОписаниеЭлементовКМ = Новый Структура("GTIN, СерийныйНомер, МРЦСтрокой, КодПроверки, КодТНВЭД, КодТНВЭД_");
	ОписаниеЭлементовКМ.GTIN          = ОписаниеЭлементаКодаМаркировки("01",   "GTIN",         14);
	ОписаниеЭлементовКМ.СерийныйНомер = ОписаниеЭлементаКодаМаркировки("21",   "СерийныйНомер", 7, Алфавит.БуквыЦифрыЗнаки);
	ОписаниеЭлементовКМ.МРЦСтрокой    = ОписаниеЭлементаКодаМаркировки("8005", "МРЦСтрокой",    6, Алфавит.Цифры);
	ОписаниеЭлементовКМ.КодПроверки   = ОписаниеЭлементаКодаМаркировки("93",   "КодПроверки",   4, Алфавит.БуквыЦифрыЗнаки);
	ОписаниеЭлементовКМ.КодТНВЭД      = ОписаниеЭлементаКодаМаркировки("240",  "КодТНВЭД",      8, Алфавит.Цифры);
	ОписаниеЭлементовКМ.КодТНВЭД_     = ОписаниеЭлементаКодаМаркировки("240",  "КодТНВЭД_",     11, Алфавит.БуквыЦифрыЗнаки);
	
	ШаблоныСтрокой = Новый Массив;
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + МРЦСтрокой");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + МРЦСтрокой + КодПроверки");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + МРЦСтрокой + КодТНВЭД");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + МРЦСтрокой + КодПроверки + КодТНВЭД");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + КодПроверки");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + КодТНВЭД");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + КодПроверки + КодТНВЭД");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + КодПроверки + КодТНВЭД_");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + МРЦСтрокой + КодПроверки + КодТНВЭД_");
	
	СписокШаблонов = ОписанияШаблоновКодаМаркировки(ОписаниеЭлементовКМ, ШаблоныСтрокой);
	
	ТипШтрихкодаИВидУпаковки = ТипШтрихкодаИВидУпаковки();
	ТипШтрихкодаИВидУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	ТипШтрихкодаИВидУпаковки.ВидУпаковки  = Перечисления.ВидыУпаковокМаркировки.Групповая;
	
	СоставКодаМаркировки = НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки);
	СоставКодаМаркировки.Вставить("МРЦ",         0);
	СоставКодаМаркировки.Вставить("МРЦСтрокой", "");
	СоставКодаМаркировки.Вставить("КодТНВЭД",   "");
	
	Для Каждого ОписаниеШаблонаКодаМаркировки Из СписокШаблонов Цикл
	
		НастройкаОписанияКодаМаркировки = Новый Структура(
			"ВидПродукции, ТипШтрихкодаИВидУпаковки, СоставКодаМаркировки, ОписаниеШаблонаКодаМаркировки, ДанныеОбщегоМодуля");
		НастройкаОписанияКодаМаркировки.ВидПродукции                  = ВидПродукции;
		НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки      = ТипШтрихкодаИВидУпаковки;
		НастройкаОписанияКодаМаркировки.СоставКодаМаркировки          = СоставКодаМаркировки;
		НастройкаОписанияКодаМаркировки.ОписаниеШаблонаКодаМаркировки = ОписаниеШаблонаКодаМаркировки;
		НастройкаОписанияКодаМаркировки.ДанныеОбщегоМодуля            = ДанныеОбщегоМодуля;
		
		ДобавитьОписаниеШаблонаКодаМаркировкиВидаПродукции(
			НастройкиРазбораКодаМаркировки, НастройкаОписанияКодаМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует описание кода маркировки для табачной пачки
Процедура ОписаниеКодаМаркировкиТабачнойПачки(НастройкиРазбораКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля)
	
	Алфавит = НастройкиРазбораКодаМаркировки.Алфавит;
	
	ОписаниеЭлементовКМ = Новый Структура("GTIN, СерийныйНомер, МРЦСтрокой, КодПроверки");
	ОписаниеЭлементовКМ.GTIN          = ОписаниеЭлементаКодаМаркировки("", "GTIN",         14);
	ОписаниеЭлементовКМ.СерийныйНомер = ОписаниеЭлементаКодаМаркировки("", "СерийныйНомер", 7, Алфавит.БуквыЦифрыЗнаки);
	ОписаниеЭлементовКМ.МРЦСтрокой    = ОписаниеЭлементаКодаМаркировки("", "МРЦСтрокой",    4, Алфавит.БуквыЦифрыЗнакиМРЦ);
	ОписаниеЭлементовКМ.КодПроверки   = ОписаниеЭлементаКодаМаркировки("", "КодПроверки",   4, Алфавит.БуквыЦифрыЗнаки);
	
	ШаблоныСтрокой = Новый Массив;
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + МРЦСтрокой");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + МРЦСтрокой + КодПроверки");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + КодПроверки");
	
	СписокШаблонов = ОписанияШаблоновКодаМаркировки(ОписаниеЭлементовКМ, ШаблоныСтрокой);
	
	ТипШтрихкодаИВидУпаковки = ТипШтрихкодаИВидУпаковки();
	ТипШтрихкодаИВидУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.DataMatrix;
	ТипШтрихкодаИВидУпаковки.ВидУпаковки  = Перечисления.ВидыУпаковокМаркировки.Потребительская;
	
	СоставКодаМаркировки = НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки);
	СоставКодаМаркировки.Вставить("МРЦ",         0);
	СоставКодаМаркировки.Вставить("МРЦСтрокой", "");
	
	Для Каждого ОписаниеШаблонаКодаМаркировки Из СписокШаблонов Цикл
		
		НастройкаОписанияКодаМаркировки = Новый Структура(
			"ВидПродукции, ТипШтрихкодаИВидУпаковки, СоставКодаМаркировки, ОписаниеШаблонаКодаМаркировки, ДанныеОбщегоМодуля");
		НастройкаОписанияКодаМаркировки.ВидПродукции                  = ВидПродукции;
		НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки      = ТипШтрихкодаИВидУпаковки;
		НастройкаОписанияКодаМаркировки.СоставКодаМаркировки          = СоставКодаМаркировки;
		НастройкаОписанияКодаМаркировки.ОписаниеШаблонаКодаМаркировки = ОписаниеШаблонаКодаМаркировки;
		НастройкаОписанияКодаМаркировки.ДанныеОбщегоМодуля            = ДанныеОбщегоМодуля;
		
		ДобавитьОписаниеШаблонаКодаМаркировкиВидаПродукции(
			НастройкиРазбораКодаМаркировки, НастройкаОписанияКодаМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует описание кода маркировки для обуви
Процедура ОписаниеКодаМаркировкиОбуви(НастройкиРазбораКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля)
	
	Алфавит = НастройкиРазбораКодаМаркировки.Алфавит;
	
	ОписаниеЭлементовКМ = Новый Структура("GTIN, СерийныйНомер, КодТНВЭД, КлючПроверки, Подпись");
	ОписаниеЭлементовКМ.GTIN          = ОписаниеЭлементаКодаМаркировки("01",  "GTIN",          14);
	ОписаниеЭлементовКМ.СерийныйНомер = ОписаниеЭлементаКодаМаркировки("21",  "СерийныйНомер", 13, Алфавит.БуквыЦифрыЗнаки);
	ОписаниеЭлементовКМ.КодТНВЭД      = ОписаниеЭлементаКодаМаркировки("240", "КодТНВЭД",       4, Алфавит.Цифры);
	ОписаниеЭлементовКМ.КлючПроверки  = ОписаниеЭлементаКодаМаркировки("91",  "КлючПроверки",   4, Алфавит.БуквыЦифрыЗнаки);
	ОписаниеЭлементовКМ.Подпись       = ОписаниеЭлементаКодаМаркировки("92",  "Подпись",       88, Алфавит.БуквыЦифрыЗнаки);
	
	ШаблоныСтрокой = Новый Массив;
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + КодТНВЭД");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + КлючПроверки + Подпись");
	ШаблоныСтрокой.Добавить("GTIN + СерийныйНомер + КодТНВЭД + КлючПроверки + Подпись");
	
	СписокШаблонов = ОписанияШаблоновКодаМаркировки(ОписаниеЭлементовКМ, ШаблоныСтрокой);
	
	ТипШтрихкодаИВидУпаковки = ТипШтрихкодаИВидУпаковки();
	ТипШтрихкодаИВидУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	ТипШтрихкодаИВидУпаковки.ВидУпаковки  = Перечисления.ВидыУпаковокМаркировки.Потребительская;
	
	СоставКодаМаркировки = НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки);
	СоставКодаМаркировки.Вставить("КодТНВЭД", "");
	
	Для Каждого ОписаниеШаблонаКодаМаркировки Из СписокШаблонов Цикл
		
		НастройкаОписанияКодаМаркировки = Новый Структура(
			"ВидПродукции, ТипШтрихкодаИВидУпаковки, СоставКодаМаркировки, ОписаниеШаблонаКодаМаркировки, ДанныеОбщегоМодуля");
		НастройкаОписанияКодаМаркировки.ВидПродукции                  = ВидПродукции;
		НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки      = ТипШтрихкодаИВидУпаковки;
		НастройкаОписанияКодаМаркировки.СоставКодаМаркировки          = СоставКодаМаркировки;
		НастройкаОписанияКодаМаркировки.ОписаниеШаблонаКодаМаркировки = ОписаниеШаблонаКодаМаркировки;
		НастройкаОписанияКодаМаркировки.ДанныеОбщегоМодуля            = ДанныеОбщегоМодуля;
		
		ДобавитьОписаниеШаблонаКодаМаркировкиВидаПродукции(
			НастройкиРазбораКодаМаркировки, НастройкаОписанияКодаМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует описание кода маркировки для логистической упаковки
Процедура ОписаниеКодаМаркировкиЛогистическаяУпаковка18(НастройкиРазбораКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля)
	
	// Примеры:
	//	- исмп:
	//	* 199988888800000013 - из сервиса
	
	Алфавит = НастройкиРазбораКодаМаркировки.Алфавит;
	
	ОписаниеЭлементовКМ = Новый Структура("SSCC");
	ОписаниеЭлементовКМ.SSCC = ОписаниеЭлементаКодаМаркировки("", "SSCC", 18, Алфавит.Цифры); // Серийный код транспортной упаковки, представленный в виде цифрового номера.
	
	ШаблоныСтрокой = Новый Массив;
	ШаблоныСтрокой.Добавить("SSCC");
	
	СписокШаблонов = ОписанияШаблоновКодаМаркировки(ОписаниеЭлементовКМ, ШаблоныСтрокой);
	
	ТипШтрихкодаИВидУпаковки = ТипШтрихкодаИВидУпаковки();
	ТипШтрихкодаИВидУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.SSCC;
	ТипШтрихкодаИВидУпаковки.ВидУпаковки  = Перечисления.ВидыУпаковокМаркировки.Логистическая;
	
	СоставКодаМаркировки = НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки);
	
	Для Каждого ОписаниеШаблонаКодаМаркировки Из СписокШаблонов Цикл
		
		НастройкаОписанияКодаМаркировки = Новый Структура(
			"ВидПродукции, ТипШтрихкодаИВидУпаковки, СоставКодаМаркировки, ОписаниеШаблонаКодаМаркировки, ДанныеОбщегоМодуля");
		НастройкаОписанияКодаМаркировки.ВидПродукции                  = ВидПродукции;
		НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки      = ТипШтрихкодаИВидУпаковки;
		НастройкаОписанияКодаМаркировки.СоставКодаМаркировки          = СоставКодаМаркировки;
		НастройкаОписанияКодаМаркировки.ОписаниеШаблонаКодаМаркировки = ОписаниеШаблонаКодаМаркировки;
		НастройкаОписанияКодаМаркировки.ДанныеОбщегоМодуля            = ДанныеОбщегоМодуля;
		
		ДобавитьОписаниеШаблонаКодаМаркировкиВидаПродукции(
			НастройкиРазбораКодаМаркировки, НастройкаОписанияКодаМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует описание кода маркировки для логистической упаковки
Процедура ОписаниеКодаМаркировкиЛогистическаяУпаковка20(НастройкиРазбораКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля)
	
	// Примеры:
	//	- исмп:
	//	* (00)199988888800000013 - в ИБ
	//	* 00199988888800000013 - от сканера
	//	- мотп:
	//	* 00199988888800000013 - из сервиса, от сканера
	//	* (00)199988888800000013 - в ИБ
	
	Алфавит = НастройкиРазбораКодаМаркировки.Алфавит;
	
	ОписаниеЭлементовКМ = Новый Структура("SSCC");
	ОписаниеЭлементовКМ.SSCC = ОписаниеЭлементаКодаМаркировки("00", "SSCC", 18, Алфавит.Цифры); // Серийный код транспортной упаковки, представленный в виде цифрового номера.
	
	ШаблоныСтрокой = Новый Массив;
	ШаблоныСтрокой.Добавить("SSCC");
	
	СписокШаблонов = ОписанияШаблоновКодаМаркировки(ОписаниеЭлементовКМ, ШаблоныСтрокой);
	
	ТипШтрихкодаИВидУпаковки = ТипШтрихкодаИВидУпаковки();
	ТипШтрихкодаИВидУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.SSCC;
	ТипШтрихкодаИВидУпаковки.ВидУпаковки  = Перечисления.ВидыУпаковокМаркировки.Логистическая;
	
	СоставКодаМаркировки = НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки);
	
	Для Каждого ОписаниеШаблонаКодаМаркировки Из СписокШаблонов Цикл
		
		НастройкаОписанияКодаМаркировки = Новый Структура(
			"ВидПродукции, ТипШтрихкодаИВидУпаковки, СоставКодаМаркировки, ОписаниеШаблонаКодаМаркировки, ДанныеОбщегоМодуля");
		НастройкаОписанияКодаМаркировки.ВидПродукции                  = ВидПродукции;
		НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки      = ТипШтрихкодаИВидУпаковки;
		НастройкаОписанияКодаМаркировки.СоставКодаМаркировки          = СоставКодаМаркировки;
		НастройкаОписанияКодаМаркировки.ОписаниеШаблонаКодаМаркировки = ОписаниеШаблонаКодаМаркировки;
		НастройкаОписанияКодаМаркировки.ДанныеОбщегоМодуля            = ДанныеОбщегоМодуля;
		
		ДобавитьОписаниеШаблонаКодаМаркировкиВидаПродукции(
			НастройкиРазбораКодаМаркировки, НастройкаОписанияКодаМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеЭлементаКодаМаркировки(Код, Имя, КоличествоЗнаков, АлфавитДопустимыхСимволов = "")
	
	ОписаниеКода = Новый Структура;
	ОписаниеКода.Вставить("Код",     Код);
	ОписаниеКода.Вставить("Имя",     Имя);
	ОписаниеКода.Вставить("Длина",   КоличествоЗнаков);
	ОписаниеКода.Вставить("Алфавит", АлфавитДопустимыхСимволов);
	
	Возврат ОписаниеКода;
	
КонецФункции

// Вычисляет штрихкода EAN по коду маркировки.
//
// Параметры:
//  КодМаркировки - Строка - Описание
// Возвращаемое значение:
//  Неопределено, Строка - Описание
Функция EANПоКодуМаркировки(КодМаркировки)
	
	Если СтрНачинаетсяС(КодМаркировки, "(") Тогда
		GTIN = Сред(КодМаркировки, 5, 14);
	Иначе
		GTIN = Лев(КодМаркировки, 14);
	КонецЕсли;
	
	ЭтоGTIN = ШтрихкодированиеМПКлиентСервер.ПроверитьКорректностьGTIN(GTIN);
	Если Не ЭтоGTIN Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	EAN = ШтрихкодированиеМПКлиентСервер.ШтрихкодEANИзGTIN(GTIN);
	
	Возврат EAN;
	
КонецФункции

Процедура ДобавитьОписаниеШаблонаКодаМаркировкиВидаПродукции(НастройкиРазбораКодаМаркировки, НастройкаОписанияКодаМаркировки) Экспорт
	
	ВидПродукции                   = НастройкаОписанияКодаМаркировки.ВидПродукции;
	ОписаниеШаблонаКодаМаркировки  = НастройкаОписанияКодаМаркировки.ОписаниеШаблонаКодаМаркировки;
	ТипШтрихкодаИВидУпаковки       = НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки;
	
	ШаблоныКодовМаркировки         = НастройкиРазбораКодаМаркировки.ШаблоныКодовМаркировкиПоВидамПродукции;
	ШаблоныИОписанияВидовПродукции = НастройкиРазбораКодаМаркировки.ШаблоныИОписанияВидовПродукции;
	
	НачинаетсяСоСкобки  = Ложь;
	ДлинаКодаМаркировки = 0;
	Шаблон              = "";
	
	Шаблон = СтрШаблон("[%1]", ТипШтрихкодаИВидУпаковки.ТипШтрихкода) + " ";
	
	КонечныйИндекс = ОписаниеШаблонаКодаМаркировки.ВГраница();
	Для ТекущийИндекс = 0 По КонечныйИндекс Цикл
		
		ОписаниеЭлементаКМ = ОписаниеШаблонаКодаМаркировки[ТекущийИндекс];
		
		Если ТекущийИндекс = 0 Тогда
			НачинаетсяСоСкобки = ЗначениеЗаполнено(ОписаниеЭлементаКМ.Код);
			КодПервогоЭлемента = ОписаниеЭлементаКМ.Код;
		КонецЕсли;
		
		ДлинаКодаМаркировки = ДлинаКодаМаркировки + СтрДлина(ОписаниеЭлементаКМ.Код) + ОписаниеЭлементаКМ.Длина;
		
		Если НачинаетсяСоСкобки Тогда
			ШаблонЭлементаКМ = СтрШаблон("%1 + %2 (%3 chars)",
				ОписаниеЭлементаКМ.Код, ОписаниеЭлементаКМ.Имя, ОписаниеЭлементаКМ.Длина);
		Иначе
			ШаблонЭлементаКМ = СтрШаблон("%1 (%2 chars)",
				ОписаниеЭлементаКМ.Имя, ОписаниеЭлементаКМ.Длина);
		КонецЕсли;
		Шаблон = Шаблон + ?(ТекущийИндекс = 0, "", " " + "+" + " ") + ШаблонЭлементаКМ;
		
		Если ТекущийИндекс = КонечныйИндекс Тогда
			
			ДлинаКодаМаркировкиСоСкобкой = 0;
			Если НачинаетсяСоСкобки Тогда
				ДлинаКодаМаркировкиСоСкобкой = ДлинаКодаМаркировки + (ТекущийИндекс + 1) * 2;
			КонецЕсли;
			
			ШаблонКМ = ШаблоныКодовМаркировки.Добавить();
			ШаблонКМ.ВидПродукции        = ВидПродукции;
			ШаблонКМ.Шаблон              = Шаблон;
			ШаблонКМ.ТипШтрихкода        = ТипШтрихкодаИВидУпаковки.ТипШтрихкода;
			ШаблонКМ.ВидУпаковки         = ТипШтрихкодаИВидУпаковки.ВидУпаковки;
			ШаблонКМ.КоличествоЭлементов = ТекущийИндекс + 1;
			ШаблонКМ.НачинаетсяСоСкобки  = НачинаетсяСоСкобки;
			ШаблонКМ.Длина               = ДлинаКодаМаркировки;
			ШаблонКМ.ДлинаСоСкобкой      = ДлинаКодаМаркировкиСоСкобкой;
			ШаблонКМ.КодПервогоЭлемента  = КодПервогоЭлемента;
			
			ЗаполнениеШаблоновИОписанийВидовПродукции(ШаблоныИОписанияВидовПродукции, НастройкаОписанияКодаМаркировки, Шаблон);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнениеШаблоновИОписанийВидовПродукции(ШаблоныИОписанияВидовПродукции, НастройкаОписанияКодаМаркировки, Шаблон)
	
	// Формируем описание и состав кода маркировки в соответствии с составом текущего шаблона
	ОписаниеТекущегоШаблона = ШаблоныИОписанияВидовПродукции[Шаблон];
	Если ОписаниеТекущегоШаблона = Неопределено Тогда
		
		СоставКодаМаркировки          = ОбщегоНазначения.СкопироватьРекурсивно(НастройкаОписанияКодаМаркировки.СоставКодаМаркировки);
		ОписаниеШаблонаКодаМаркировки = НастройкаОписанияКодаМаркировки.ОписаниеШаблонаКодаМаркировки;
		
		ОписаниеТекущегоШаблона = Новый Структура;
		ОписаниеТекущегоШаблона.Вставить("ВидыПродукции",               Новый Массив);
		ОписаниеТекущегоШаблона.Вставить("ОписаниеКодаМаркировки",      ОписаниеШаблонаКодаМаркировки);
		ОписаниеТекущегоШаблона.Вставить("СоставКодаМаркировки",        СоставКодаМаркировки);
		ОписаниеТекущегоШаблона.Вставить("ОбщиеМодулиШтрихкодирования", Новый Массив);
		
		ШаблоныИОписанияВидовПродукции[Шаблон] = ОписаниеТекущегоШаблона;
		
	КонецЕсли;
	
	ВидПродукции = НастройкаОписанияКодаМаркировки.ВидПродукции;
	Если ОписаниеТекущегоШаблона.ВидыПродукции.Найти(ВидПродукции) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОписаниеТекущегоШаблона.ВидыПродукции.Добавить(ВидПродукции);
	
	// Переформируем состав один раз, так что бы подходил под любой вид продукции
	Если ОписаниеТекущегоШаблона.ВидыПродукции.Количество() = 2
		И ОписаниеТекущегоШаблона.СоставКодаМаркировки.Количество() > 0 Тогда
		
		ДанныеОбщегоМодуля        = НастройкаОписанияКодаМаркировки.ДанныеОбщегоМодуля;
		НовыйСоставКодаМаркировки = ДанныеОбщегоМодуля.ОбщийМодуль.НовыйСоставКодаМаркировки(
			НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки);
		
		ОписаниеТекущегоШаблона.СоставКодаМаркировки = НовыйСоставКодаМаркировки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТипШтрихкодаИВидУпаковки() Экспорт
	Данные = Новый Структура;
	Данные.Вставить("ТипШтрихкода", Перечисления.ТипыШтрихкодов.ПустаяСсылка());
	Данные.Вставить("ВидУпаковки",  Перечисления.ВидыУпаковокМаркировки.ПустаяСсылка());
	Возврат Данные;
КонецФункции

Функция ОписанияШаблоновКодаМаркировки(ОписаниеЭлементовКМ, ШаблоныСтрокой) Экспорт
	
	СписокОписанийШаблонов = Новый Массив;
	
	Для Каждого ШаблонСтрокой Из ШаблоныСтрокой Цикл
		
		ОписаниеШаблонаКМ = Новый Массив;
		
		СписокЭлементовКМ = СтрРазделить(ШаблонСтрокой, "+", Ложь);
		Для Каждого ИмяЭлементаКМ Из СписокЭлементовКМ Цикл
			
			ОписаниеЭлементаКМ = ОписаниеЭлементовКМ[СокрЛП(ИмяЭлементаКМ)];
			
			ОписаниеШаблонаКМ.Добавить(ОписаниеЭлементаКМ);
			
		КонецЦикла;
		
		СписокОписанийШаблонов.Добавить(ОписаниеШаблонаКМ);
		
	КонецЦикла;
	
	Возврат СписокОписанийШаблонов;
	
КонецФункции
